Revit 2027 API
BuiltInFailures.OverlapFailures.ToposolidFloorOverlap Property
 Highlighted toposolid and floor overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ToposolidFloorOverlap { get; }
Public Shared ReadOnly Property ToposolidFloorOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ToposolidFloorOverlap {
	FailureDefinitionId^ get ();
}
static member ToposolidFloorOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace